INSERT INTO Roles (title_of_role, role_email, role_password) VALUES 
('Admin', 'admin1', '1'),
('Purchasing Manager', 'manager1', '2'),
('Bakery Worker', 'worder1', '3');

INSERT INTO Products (pName, ptype, pricePerUnit, outputVolume, shelflife)
VALUES 
('Хлеб белый', 'Хлебобулочные изделия', 25.00, 50, '2024-10-25'),
('Булочка с корицей', 'Выпечка', 15.00, 20, '2024-10-20'),
('Круассан', 'Выпечка', 20.00, 10, '2024-10-22'),
('Пирог с яблоками', 'Выпечка', 30.00, 30, '2024-10-30'),
('Торт шоколадный', 'Десерты', 150.00, 5, '2024-11-05'),
('Песочное печенье', 'Выпечка', 10.00, 100, '2024-10-18'),
('Багет', 'Хлебобулочные изделия', 18.00, 35, '2024-10-24'),
('Пирожное эклер', 'Десерты', 25.00, 22, '2024-10-28'),
('Пирог с вишней', 'Выпечка', 35.00, 14, '2024-10-29'),
('Кекс', 'Десерты', 40.00, 33, '2024-11-01');

INSERT INTO Ingredients (iName, unitOfMeasurement, pricePerUnit, availableQuantity)
VALUES 
('Мука', 'кг', 5.50, 100),
('Сахар', 'кг', 10.80, 200),
('Яйца', 'шт', 10.00, 120),
('Масло сливочное', 'кг', 50.00, 7),
('Дрожжи', 'кг', 15.00, 1),
('Соль', 'кг', 2.80, 20),
('Молоко', 'л', 80.00, 60),
('Ванильный экстракт', 'л', 25.00, 10),
('Какао-порошок', 'кг', 10.00, 20),
('Орехи грецкие', 'кг', 12.00, 150);

INSERT INTO ProductСomposition (product_id, ingredient_id)
VALUES 
(1, 1),  -- Хлеб белый - Мука
(1, 2),  -- Хлеб белый - Сахар
(1, 3),  -- Хлеб белый - Яйца
(2, 1),  -- Булочка с корицей - Мука
(2, 2),  -- Булочка с корицей - Сахар
(2, 3),  -- Булочка с корицей - Яйца
(3, 1),  -- Круассан - Мука
(3, 4),  -- Круассан - Масло сливочное
(4, 1),  -- Пирог с яблоками - Мука
(4, 2),  -- Пирог с яблоками - Сахар
(4, 3),  -- Пирог с яблоками - Яйца
(5, 1),  -- Торт шоколадный - Мука
(5, 2),  -- Торт шоколадный - Сахар
(5, 4),  -- Торт шоколадный - Масло сливочное
(6, 1),  -- Песочное печенье - Мука
(6, 2),  -- Песочное печенье - Сахар
(7, 1),  -- Багет - Мука
(7, 2),  -- Багет - Сахар
(8, 1),  -- Пирожное эклер - Мука
(8, 3),  -- Пирожное эклер - Яйца
(9, 1),  -- Пирог с вишней - Мука
(9, 2),  -- Пирог с вишней - Сахар
(10, 1), -- Кекс - Мука
(10, 2); -- Кекс - Сахар 

INSERT INTO Suppliers (sName, contactInformation)
VALUES 
('Поставщик А', '81171717171'),
('Поставщик Б', '89898989898');


INSERT INTO suppliedIngredients (supplier_id, ingredient_id, ingredient_quntity)
VALUES 
(1, 1, 100),  
(1, 2, 200),  
(2, 3, 150);  

INSERT INTO Orders (orderDate, condition)
VALUES 
(sysdatetime(), 'Выполнен'),
(sysdatetime(), 'Выполнен'),
(sysdatetime(), 'Выполнен'),
(sysdatetime(), 'Новый');

INSERT INTO OrderedProducts (order_id, product_id, quantityOfProducts)
VALUES 
(3, 1, 10),
(3, 2, 5),
(5, 1, 20),
(4, 3, 3),
(5, 2, 7);